[
  {
    "icon": "/static/冯依曼.jpg",
    "title": "一个极简的刀塔游戏",
    "date": "23/06/12",
    "contents": "<p>不知道为什么总有人说dota比lol、农药更难上手。那么为了结束这个争论，不妨设想、甚至真的设计这样一个最简版的dota：</p><p><ul><li>技能简化，只有6种不同的英雄，分别为远力、近力，远敏，近敏，远智，近智。<ul><li>力量提供生命、生命恢复</li><li>敏捷提供物理攻击速度、护甲</li><li>智力提供法力、法力回复</li></li><li>每一个英雄具有一个普通攻击，没有其他技能。<li>智力英雄的普通攻击造成法术伤害但需要消耗法力</li><li>敏捷英雄造成物理伤害</li><li>力量英雄的攻击造成较少物理伤害但带有眩晕效果</li><li>近战英雄造成范围伤害，远程英雄造成单体伤害。</li></ul></li><li>装备简化，分为属性、被动和主动。<ul><li>属性装备只有力量+1、敏捷+1、智力+1。可以无限叠加，但是每购买一次，价格会略微上升（三个属性分别计算）。</li><li>被动装备提供一项被动技能，其中部分可叠加，包括<ul><li>加速：增加自身移速</li><li>防御光环：为队友提供一定的护甲、攻速、恢复、魔抗</li><li>破坏光环：降低对方攻击力、攻击速度、护甲</li><li>伤害光环：对周边敌人持续造成伤害</li><li>护身：在血量达到一定阈值时自动触发，无敌一小段时间但不能造成伤害</li><li>闪避：有几率闪避攻击</li><li>必中：无视对方闪避；低地打高地自带25%闪避率也可以被无视</li><li>冰冻：普攻造成减速的同时降低对方恢复</li><li>吸血：普攻吸血</li><li>破法：普攻削除对方法力</li><li>溅射：普攻造成溅射</li><li>腐蚀：普攻降低对方护甲/魔抗（智力型降低魔抗）</li><li>重击：普攻造成眩晕</li><li>暴击：普攻造成多倍伤害</li></ul></li><li>主动装备提供一项主动技能，包括：<ul><li>侦查：放置一个假眼</li><li>守卫：放置一个真眼，没有视野但是可以显示隐形单位</li><li>反隐：为区域内的所有敌人增加负面效果，无法进入隐身且减速</li><li>偷袭：身边队友隐形，进入敌方一定距离后现形</li><li>位移：移动到小范围内指定地点</li><li>控制：包括锁闭（禁止主动装备）、破坏（禁止被动装备）、缴械、减速、束缚、变羊、眩晕、驱散（敌人）</li><li>生存：包括物免、魔免、分身、吹风、渐隐、治疗、驱散（自己）</li><li>召唤：召唤单位协助你的作战</li></ul></li><li>杀死肉山可以获得一次性复活</li><li>你最多可以携带9件装备，其中最多6件主动</li></ul></li><li>资源简化<ul><li>敌方小兵死亡时，旁边的所有友方都可以获得经济。</li><li>友方小兵血量低于10%时，友方英雄的下一次普通攻击会将其反补（同时还会攻击敌人）。<li>若你在拉野时间出现在拉野点，则兵线会帮助你战斗（完成拉野）</li><li>若你在叠野时间出现在野点，则会增加一波野。</li></ul></li></ul></p><p>上述设计的目的是玩家不需要了解繁琐的技能和装备机制，而专心于在视野和装备克制上进行博弈。虽然一些比较有特色的机制无法体现，但是对于被dota所谓的复杂性吓跑的玩家而言，或许是一张不错的体验券。</p>"
  },
  {
    "icon": "/static/冯依曼.jpg",
    "title": "学历教育",
    "date": "23/03/21",
    "contents": "<p>我对现在的学历教育有点焦虑了。</p><p>焦虑的主要原因是，我一位上中专的朋友，凭借着对一切的极大兴趣自学成才，然后现在各方面水平（不光是对方的专业、我的专业、还有一切我所能接触到的学科）完爆我十条街了。我承认像他这样超凡的人一定是少数；我不知道为什么这位朋友通过什么样的方式学习获得了这样的才华，也不确定未来哪边能够走得更远。我也觉得没必要分析。</p><p>我仅仅是自顾自地焦虑而已。</p>"
  },{
    "icon": "/static/冯依曼.jpg",
    "title": "冯依曼天堂",
    "date": "23/03/20",
    "contents": "<p>虽然概率很小，但是仍然可能存在这么一个宇宙。</p><p>在这里，每一个人都有同样的外貌、同样的性格、同样的爱好。</p><p>她们都是冯依曼。</p><p>想必这里是魏潇承的天堂了吧。</p><p>然而阴差阳错地，意外来到这个宇宙的并不是魏潇承，而是他那背负着整个世界树命运的妹妹。</p>"
  },
  {
    "icon": "/static/冯依曼.jpg",
    "title": "语言模型",
    "date": "23/03/20",
    "contents": "<p>众所周知，机器学习是基于统计学的、经验主义的。最近火爆的所谓“语言模型”，无外乎是将文字囫囵吞枣地统计，然后像写八股一样地挤出来。没有知识图谱或者专家系统的支持，语言模型或许能理解符号系统中词汇与词汇之间的逻辑关联，却无法理解它所代表的内涵。换句话说，当今的语言模型，与一个刚刚学了几个专业术语、就在完全没有领会内涵的前提下疯狂念经的魔怔人相比，并没有什么两样。</p><p>然而，机器学习的实践中有一项重要的流程叫做反向传播。当输出的结果与预期不符合的时候，可以将估价函数关于输入的梯度反向传播到模型的参数当中去。用人话讲，就是“知错就改”。只要能够“反向传播”，哪怕只是经验主义、哪怕只是魔怔念经，也可以在长期的反馈中逐渐纠正自己的错误。哪怕是一个纯粹形而上的“语言模型”，也能够讲出人模人样的话来。</p><p>那么，这些什么“语言模型”，要淘汰的是什么样的人呢？它们淘汰的，将会是那些怎么也学不会“反向传播”的人。</p>"
  },
  {
    "icon": "/static/冯依曼.jpg",
    "title": "卖叙事电池的sol",
    "date": "23/03/18",
    "contents": "<p>sol启动了一节叙事电池。他看到了刷刷的笑容，但是幻象转瞬即逝。</p><p>sol又启动了一节。他看到刷刷向他伸出手，但是幻象转瞬即逝。</p><p>这时，天空中闪现了叙事引擎的光芒，EXP碎片如流星般坠落。sol借机启动了所有的叙事电池。一个全新的世界线在强大的愿望中诞生，刷刷拉着sol走向了民政局（？）</p><p>第二天，人们发现sol在自己床上__死了。</p>"
  }
]